# GetCustomHandleTag Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarHandleNameData..::..GetCustomHandleTag Method
RebarHandleNameData Class See Also
---
Gets the handle tag for which we need to specify the name.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public int GetCustomHandleTag()
```

Visual Basic
---
```text
Public Function GetCustomHandleTag As Integer
```

Visual C++
---
```text
public:
int GetCustomHandleTag()
```

# ### Return Value
Returns the handle tag for which we need to specify the name.
# See Also
RebarHandleNameData Class
Autodesk.Revit.DB.Structure Namespace